# Tugas Pengantar Model Linear P7
* Nama : Ryan Fadhilah Faizal Hakim
* NRP  : 2C2220007

In [84]:
import pandas as pd
import numpy as np
import statsmodels.api as sm

### Data Preparation

In [85]:
data2 = {
    'x1' : [175, 175, 235, 215, 195, 195],
    'y1' : [135, 145, 205, 175, 140, 190]
}

data3 = {
    'x2' : [205, 175, 230, 190, 155, 185],
    'y2' : [165, 195, 160, 155, 150, 170]
}

a = 2
M = 1
alpha = 0.05

belajar2 = pd.DataFrame(data2)

belajar2

    x1   y1
0  175  135
1  175  145
2  235  205
3  215  175
4  195  140
5  195  190

In [86]:
belajar3 = pd.DataFrame(data3)

belajar3

    x2   y2
0  205  165
1  175  195
2  230  160
3  190  155
4  155  150
5  185  170

In [87]:
sts = ['N', 'sum(x)', 'sum(x^2)', 'sum(y)', 'sum(y^2)', 'sum(xy)', 'mean(x)', 'mean(y)']

sts

['N',
 'sum(x)',
 'sum(x^2)',
 'sum(y)',
 'sum(y^2)',
 'sum(xy)',
 'mean(x)',
 'mean(y)']

In [88]:
A1 = [len(belajar2), sum(belajar2['x1']), sum(belajar2['x1'] ** 2), sum(belajar2['y1']), sum(belajar2['y1'] ** 2), sum(belajar2['x1'] * belajar2['y1']), belajar2['x1'].mean(), belajar2['y1'].mean()]

A1

[6, 1190, 238750, 990, 167600, 199150, 198.33333333333334, 165.0]

In [89]:
tabel = pd.DataFrame(sts)

tabel.columns = ['Statistik']

tabel

  Statistik
0         N
1    sum(x)
2  sum(x^2)
3    sum(y)
4  sum(y^2)
5   sum(xy)
6   mean(x)
7   mean(y)

In [90]:
tabel['A1'] = A1

tabel

  Statistik             A1
0         N       6.000000
1    sum(x)    1190.000000
2  sum(x^2)  238750.000000
3    sum(y)     990.000000
4  sum(y^2)  167600.000000
5   sum(xy)  199150.000000
6   mean(x)     198.333333
7   mean(y)     165.000000

In [91]:
A2 = [len(belajar3), sum(belajar3['x2']), sum(belajar3['x2'] ** 2), sum(belajar3['y2']), sum(belajar3['y2'] ** 2), sum(belajar3['x2'] * belajar3['y2']), belajar3['x2'].mean(), belajar3['y2'].mean()]

tabel['A2'] = A2

tabel

  Statistik             A1             A2
0         N       6.000000       6.000000
1    sum(x)    1190.000000    1140.000000
2  sum(x^2)  238750.000000  219900.000000
3    sum(y)     990.000000     995.000000
4  sum(y^2)  167600.000000  166275.000000
5   sum(xy)  199150.000000  188900.000000
6   mean(x)     198.333333     190.000000
7   mean(y)     165.000000     165.833333

In [92]:
totalA1A2 = round(tabel['A1'] + tabel['A2'], 4)
totalA1A2

0        12.0000
1      2330.0000
2    458650.0000
3      1985.0000
4    333875.0000
5    388050.0000
6       388.3333
7       330.8333
dtype: float64

### Tabel Summary

In [93]:
tabel['Total'] = totalA1A2

tabel

  Statistik             A1             A2        Total
0         N       6.000000       6.000000      12.0000
1    sum(x)    1190.000000    1140.000000    2330.0000
2  sum(x^2)  238750.000000  219900.000000  458650.0000
3    sum(y)     990.000000     995.000000    1985.0000
4  sum(y^2)  167600.000000  166275.000000  333875.0000
5   sum(xy)  199150.000000  188900.000000  388050.0000
6   mean(x)     198.333333     190.000000     388.3333
7   mean(y)     165.000000     165.833333     330.8333

### Sumber Variasi Total (Residu)

In [94]:
JKyt = (tabel['Total'].iloc[4] - ((tabel['Total'].iloc[3]) ** 2 / tabel['Total'].iloc[0])).round(3)

JKxt = (tabel['Total'].iloc[2] - ((tabel['Total'].iloc[1]) ** 2 / tabel['Total'].iloc[0])).round(3)

JPxyt = (tabel['Total'].iloc[5] - ((tabel['Total'].iloc[1] * tabel['Total'].iloc[3]) / tabel['Total'].iloc[0])).round(3)

Betat = JPxyt / JKxt

JKregt = round(Betat * JPxyt, 3)

JKrest = round(JKyt - JKregt, 3)

print('JKyt =', JKyt)
print('JKxt =', JKxt)
print('JPxyt =', JPxyt)
print('Betat =', Betat)
print('JKregt =', JKregt)
print('JKrest =', JKrest)

JKyt = 5522.917
JKxt = 6241.667
JPxyt = 2629.167
Betat = 0.4212283353149086
JKregt = 1107.48
JKrest = 4415.437

### Sumber Variasi Dalam (JK dalam residu)

In [95]:
JKyd = (tabel['Total'].iloc[4] - (tabel['A1'].iloc[3] ** 2 / tabel['A1'].iloc[0] + tabel['A2'].iloc[3] ** 2 / tabel['A2'].iloc[0])).round(3)

JKxd = (tabel['Total'].iloc[2] - (tabel['A1'].iloc[1] ** 2 / tabel['A1'].iloc[0] + tabel['A2'].iloc[1] ** 2 / tabel['A2'].iloc[0])).round(3)

JPxyd = (tabel['Total'].iloc[5] - (tabel['A1'].iloc[1] * tabel['A1'].iloc[3] / tabel['A1'].iloc[0] + tabel['A2'].iloc[1] * tabel['A2'].iloc[3] / tabel['A2'].iloc[0])).round(3)

Betad = JPxyd / JKxd

JKregd = round(Betad * JPxyd, 3)

JKresd = round(JKyd - JKregd, 3)

print('JKyd =', JKyd)
print('JKxd =', JKxd)
print('JPxyd =', JPxyd)
print('Betad =', Betad)
print('Jkregd =', JKregd)
print('JKresd =', JKresd)

JKyd = 5520.833
JKxd = 6033.333
JPxyd = 2650.0
Betad = 0.43922654360367647
Jkregd = 1163.95
JKresd = 4356.883

### Sumber Variasi Antar

In [96]:
JKA = JKrest - JKresd

JKA

58.55400000000009

### Menghitung Derajat kebebasan

In [97]:
DKA = a - 1

DKD = tabel['Total'].iloc[0] - a - M

DKT = tabel['Total'].iloc[0] - 1 - M

print('DKA =', DKA)
print('DKD =', DKD)
print('DKT =', DKT)

DKA = 1
DKD = 9.0
DKT = 10.0

### Menghitung Rata-rata Kuadrat (RK)

In [98]:
RKA = JKA / DKA 

RKD = JKresd / DKD

print('RKA =', RKA)
print('RKD =', RKD)

RKA = 58.55400000000009
RKD = 484.0981111111111

### Menghitung Nilai F hitung

In [99]:
F = round(RKA / RKD, 3)

F

0.121

### Menentukan F Tabel

In [100]:
import scipy.stats as stats

Ftabel = stats.f.ppf(1 - alpha, DKA, DKD).round(2)

Ftabel

5.12

### Rangkuman Ancova 1 Faktor

In [101]:
tabel_ancova = {
    'Statistik' : ['Antar', 'Dalam (error)', 'Total (residu)']
}

tabelAncova = pd.DataFrame(tabel_ancova)

tabelAncova['JK'] = [RKA, JKresd, JKrest]

tabelAncova['DK'] = [DKA, DKD, DKT]

tabelAncova['RK'] = [RKA, RKD.round(3), [np.nan]]

tabelAncova['F'] = [F, [np.nan], [np.nan]]

tabelAncova['F Tabel'] = [Ftabel, [np.nan], [np.nan]]

tabelAncova

        Statistik        JK    DK       RK      F F Tabel
0           Antar    58.554   1.0   58.554  0.121    5.12
1   Dalam (error)  4356.883   9.0  484.098  [nan]   [nan]
2  Total (residu)  4415.437  10.0    [nan]  [nan]   [nan]

In [102]:
if (F < Ftabel):
    print('H0 diterima yang artinya tidak terdapat perbedaan')
else:
    print('H0 ditolak yang artinya terdapat perbedaan')

H0 diterima yang artinya tidak terdapat perbedaan